In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Corey':[63,75,88,92], 'Kevin':[48,98,92,95], 'Akshay': [87, 86, 85,88]}).T
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3', 'Quiz_4']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

In [2]:
# Create new DataFrame of one row
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 'Quiz_2':[np.NaN], 'Quiz_3': [np.NaN], 'Quiz_4':[71]}, index=['Taabish'])
df = pd.concat([df, df_new])
df

         Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey      63.0    75.0    88.0      92
Kevin      48.0    98.0    92.0      95
Akshay     87.0    86.0    85.0      88
Taabish     NaN     NaN     NaN      71

In [3]:
df['Quiz_Avg'] = df.mean(axis=1, skipna=True)
df

         Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey      63.0    75.0    88.0      92     79.50
Kevin      48.0    98.0    92.0      95     83.25
Akshay     87.0    86.0    85.0      88     86.50
Taabish     NaN     NaN     NaN      71     71.00

In [4]:
df.dtypes

Quiz_1      float64
Quiz_2      float64
Quiz_3      float64
Quiz_4        int64
Quiz_Avg    float64
dtype: object

In [5]:
df['Quiz_4'] = df['Quiz_4'].astype(float)
df

         Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey      63.0    75.0    88.0    92.0     79.50
Kevin      48.0    98.0    92.0    95.0     83.25
Akshay     87.0    86.0    85.0    88.0     86.50
Taabish     NaN     NaN     NaN    71.0     71.00